{"config": [{"config": {"strides": [1, 1], "name": "conv2d_1", "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "filters": 32, "bias_regularizer": null, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "filters": 64}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "units": 128, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "units": 10, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "theano"}